extends Node
class_name QuizData

const CHAPTER_1 = [
	{
		"type": "m",
		"question": "Πως ονομαζόταν ο Σέρβος φοιτητής που δολοφόνησε τον διάδοχο\nτης Αυστρίας Φραγκίσκο Φερδινάνδο και την συζυγό του Σοφία?",
		"choices": [
			"Ρονάλντο Ματέο", "Ρικάρντο Μόντε", "Γιοσίπ Μακαρόνι", "Γκαβρίλο Πρίντσιπ"
		],
		"correct": 4,
	},
	{
		"type": "m",
		"question": "Η συνθήκη Ειρήνης της Λωζάννης υπογράφηκε\nστις 14 Οκτώβρη 1923.",
		"choices": [
			"Σωστό", "Λάθος"
		],
		"correct": 2,
	},
	{
		"type": "c",
		"question": "Αντιστοίχισε τα συμβάντα στα έτη που συνέβησαν.",
		"a": {
			1: "Δολοφονία Φραγκίσκου Φερδινάνδου",
			2: "Εθνικός Διχασμός",
			3: "Ρώσικη Επανάσταση",
			4: "Νοεμβριανά",
		},
		"b": {
			"a": "1915",
			"b": "1916",
			"c": "1914",
			"d": "1917",
		},
		"correct": {
			1: "c",
			2: "a",
			3: "d",
			4: "b",
		}
	},
	{
		"type": "m",
		"question": "Το νέο καθεστός της Ρωσίας το 1917\nήταν κομμουνιστικό.",
		"choices": [
			"Σωστό", "Λάθος"
		],
		"correct": 1,
	},
	{
		"type": "m",
		"question": "Πως ονομαζόταν η διεθνής οργάνωση των κομμουνιστικών\nκομμάτωνπου ιδρύθηκε από το καθεστός στη Ρωσία?",
		"choices": [
			"Τρίτη Διεθνή", "Όμιλος Διεθνών Σοσιαλιστών", "Ένωση Διεθνών Σοσιαλιστών", "Πανσοσιαλιστική Επαναστατική Ένωση"
		],
		"correct": 1,
	}
]

const CHAPTER_2 = [
	{
		"type": "m",
		"question": "Ποιος ήταν ο νέος γενικός γραμματέας του\nΚομμουνιστικού Κόμματος Ρωσίας μετά τον θάνατο του Λένιν(1924)?",
		"choices": [
			"Μιχαήλ Μπακούνιν", "Καρλ Μαρξ", "Ιωσήφ Στάλιν", "Ναπολεών Βοναπάρτης"
		],
		"correct": 3,
	},
	{
		"type": "m",
		"question": "Στις 25 Μαρτίου 1924 ανακηρύχτηκε από τη Βουλή, με πρωτοβουλία\nκυρίως του Αλέξανδρου Παπαναστασίου, η αβασίλευτη δημοκρατία.",
		"choices": [
			"Σωστό", "Λάθος"
		],
		"correct": 1,
	},
	{
		"type": "c",
		"question": "Αντιστοίχισε τα συμβάντα στα έτη που συνέβησαν.",
		"a": {
			1: "Σύμφωνο Μπριάν-Κέλογκ",
			2: "Θάνατος του Λένιν",
			3: "Βαλκανικό Σύμφωνο",
			4: "Κατάληψη της Μαντζουρίας",
		},
		"b": {
			"a": "1924",
			"b": "1934",
			"c": "1928",
			"d": "1931",
		},
		"correct": {
			1: "c",
			2: "a",
			3: "b",
			4: "d",
		}
	},
	{
		"type": "m",
		"question": "Ο Χίτλερ κατήργησε μετά και από δημοψήφισμα,\nτο 1934, τον φασισμό.",
		"choices": [
			"Σωστό", "Λάθος"
		],
		"correct": 2,
	},
	{
		"type": "m",
		"question": "Ποιός πρόεδρος εφάρμοσε την νέα πολιτική\n\"New Deal\" στην Αμερική το 1933?",
		"choices": [
			"Τζο Μπάιντεν", "Φρανκλίνος Ρούζβελτ", "Άμπραχαμ Λίνκολν", "Ουίνστον Τσόρτσιλ"
		],
		"correct": 2,
	}
]

const CHAPTER_3 = [
	{
		"type": "m",
		"question": "Πότε εισέβαλαν τα γερμανικά στρατεύματα στην Πολωνία?",
		"choices": [
			"1η Οκτώβρη 1939", "15 Σεπτέμβρη 1939", "1 Σεπτέμβρη 1939", "1η Ιούνη 1939"
		],
		"correct": 3,
	},
	{
		"type": "m",
		"question": "Ο αρχηγός του Ελληνικού Λαϊκού Απελευθερωτικού Στρατού(ΕΛΑΣ)\nήταν ο Άρης Βελουχιώτης.",
		"choices": [
			"Σωστό", "Λάθος"
		],
		"correct": 1,
	},
	{
		"type": "c",
		"question": "Αντιστοίχισε τα συμβάντα στα έτη που συνέβησαν.",
		"a": {
			1: "Ενσωμάτωση Αυστρίας στο Τρίτο Ράιχ",
			2: "Γερμανική Εισβολή στην ΕΣΣΔ",
			3: "Ανατροπή Μουσολίνι",
			4: "Συνδιάσκεψη των Τριών",
		},
		"b": {
			"a": "1943",
			"b": "1945",
			"c": "1938",
			"d": "1941",
		},
		"correct": {
			1: "c",
			2: "d",
			3: "a",
			4: "b",
		}
	},
	{
		"type": "m",
		"question": "Ο Μουσολίνι εκτελέστηκε από τους παρτιζάνους\nτον Φεβρουάρη του 1945.",
		"choices": [
			"Σωστό", "Λάθος"
		],
		"correct": 2,
	},
	{
		"type": "m",
		"question": "Για ποιά χώρα υπογράφηκε συνθήκη ειρήνης στην\nΣυνδιάσκεψη του Αγίου Φραγκίσκου στις 7 Σεπτέμβρη 1951?",
		"choices": [
			"Τουρκία", "Ιταλία", "Γερμανία", "Ιαπωνία"
		],
		"correct": 4,
	}
]

const FINAL = [
	{
		"type": "m",
		"question": "Πως ονομαζόταν η διεθνής οργάνωση των κομμουνιστικών\nκομμάτωνπου ιδρύθηκε από το καθεστός στη Ρωσία?",
		"choices": [
			"Τρίτη Διεθνή", "Όμιλος Διεθνών Σοσιαλιστών", "Ένωση Διεθνών Σοσιαλιστών", "Πανσοσιαλιστική Επαναστατική Ένωση"
		],
		"correct": 1,
	},
	{
		"type": "m",
		"question": "Ο αρχηγός του Ελληνικού Λαϊκού Απελευθερωτικού Στρατού(ΕΛΑΣ)\nήταν ο Άρης Βελουχιώτης.",
		"choices": [
			"Σωστό", "Λάθος"
		],
		"correct": 1,
	},
	{
		"type": "c",
		"question": "Αντιστοίχισε τα συμβάντα στα έτη που συνέβησαν.",
		"a": {
			1: "Δολοφονία Φραγκίσκου Φερδινάνδου",
			2: "Εθνικός Διχασμός",
			3: "Ρώσικη Επανάσταση",
			4: "Νοεμβριανά",
		},
		"b": {
			"a": "1915",
			"b": "1916",
			"c": "1914",
			"d": "1917",
		},
		"correct": {
			1: "c",
			2: "a",
			3: "d",
			4: "b",
		}
	},
		{
		"type": "m",
		"question": "Στις 25 Μαρτίου 1924 ανακηρύχτηκε από τη Βουλή, με πρωτοβουλία\nκυρίως του Αλέξανδρου Παπαναστασίου, η αβασίλευτη δημοκρατία.",
		"choices": [
			"Σωστό", "Λάθος"
		],
		"correct": 1,
	},
		{
		"type": "m",
		"question": "Για ποιά χώρα υπογράφηκε συνθήκη ειρήνης στην\nΣυνδιάσκεψη του Αγίου Φραγκίσκου στις 7 Σεπτέμβρη 1951?",
		"choices": [
			"Τουρκία", "Ιταλία", "Γερμανία", "Ιαπωνία"
		],
		"correct": 4,
	}
]

const QUIZES = {
	1: CHAPTER_1,
	2: CHAPTER_2,
	3: CHAPTER_3,
	4: FINAL,
}
