clear;
close all;

s = 0.1; % Τυπική απόκλιση
Fs = 100; % Συχνότητα δειγματοληψίας
dt = 1 / Fs; % Βήμα δειγματοληψίας
t = -0.5:dt:0.5; % Διάστημα χρόνου

% Gaussian παλμός
g = (1 / (sqrt(2 * pi) * s)) * exp((-t.^2) / (2 * s^2));

% Υπολογισμός πλήθος των σημείων m
n = length(t);
m = 2^nextpow2(n);

% Υπολογισμός φάσματος πλάτους
G_f = fftshift(fft(g, m));
f = (-m/2:m/2-1)*(Fs/m);

% Σχεδίαση του παλμού στο πεδίο του χρόνου
figure;
subplot(2, 1, 1);
plot(t, g);
title('Παλμός Gaussian μορφής g');
xlabel('Χρόνος s');
ylabel('g(t)');

% Σχεδίαση του φάσματος στο πεδίο των συχνοτήτων
subplot(2, 1, 2);
plot(f, abs(G_f));
title('Φάσμα πλάτους Gf');
xlabel('Συχνότητα Hz');
ylabel('|Gf|');

% Εμφάνιση του m
disp(['Πλήθος σημείων m: ', num2str(m)]);