n = 0:40;

a = [1];
b1 = [1/4 1/4 1/4 1/4]
b2 = [1/8 1/8 1/8 1/8 1/8 1/8 1/8 1/8];

w  = randn(1,length(n)); % Θόρυβος
x1 = 2*cos((pi*n)/8);     % Είσοδος χωρίς θόρυβο
x2 = 2*cos((pi*n)/8) + w; % Είσοδος με θόρυβο

y1 = filter(b1,a,x2); % Έξοδος πρώτου συστήματος με θόρυβο
y2 = filter(b2,a,x2); % Έξοδος δεύτερου συστήματος με θόρυβο

% Γραφικές παραστάσεις
subplot(3, 2, 1);
stem(x1);
title('Είσοδος χωρίς θόρυβο');
subplot(3, 2, 2);
stem(x2);
title('Είσοδος με θόρυβο');
subplot(3, 1, 2);
stem(y1);
title('Έξοδος y1 με θόρυβο');
subplot(3, 1, 3);
stem(y2);
title('Έξοδος y2 με θόρυβο');
